apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt_netc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <arpa/inet.h>

#include <debug.h>
#include <nuttx/arch.h>
#include <nuttx/cache.h>
#include <nuttx/clock.h>
#include <nuttx/compiler.h>
#include <nuttx/net/ip.h>
#include <nuttx/net/netdev.h>
#include <nuttx/signal.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>

#include "arm_internal.h"
#include "imxrt_clockconfig.h"
#include "imxrt_netc.h"
#include "hardware/rt118x/imxrt118x_netc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define NETC_MDC_MAX_FREQUENCY          2500000u
#define NETC_MDC_DIVISOR                (2u * NETC_MDC_MAX_FREQUENCY)
#define NETC_MDIO_HOLD_RECOMMENDED      2u

#define NETC_PHY_ID1                    2u
#define NETC_PHY_ID2                    3u
#define NETC_PHY_BMSR                   1u
#define NETC_PHY_SPECIFIC_STATUS        0x11u
#define NETC_PHY_PAGE_SELECT            0x1eu
#define NETC_PHY_PAGE_DATA              0x1fu
#define NETC_YT8531_CHIP_CONFIG         0xa001u
#define NETC_YT8531_RGMII_CONFIG1       0xa003u
#define NETC_YT8531_CCR_RXC_DLY_EN      (1u << 8)
#define NETC_YT8531_RX_DELAY_SHIFT      10
#define NETC_YT8531_TX_DELAY_SHIFT      0
#define NETC_YT8531_DELAY_MASK          0xfu

#define NETC_PHY_BMSR_LINK              (1u << 2)
#define NETC_PHY_BMSR_AN_COMPLETE       (1u << 5)
#define NETC_PHY_STATUS_LINK            (1u << 10)
#define NETC_PHY_STATUS_DUPLEX          (1u << 13)
#define NETC_PHY_STATUS_SPEED_SHIFT     14
#define NETC_PHY_STATUS_SPEED_MASK      (3u << NETC_PHY_STATUS_SPEED_SHIFT)
#define NETC_PHY_STATUS_SPEED_10        (0u << NETC_PHY_STATUS_SPEED_SHIFT)
#define NETC_PHY_STATUS_SPEED_100       (1u << NETC_PHY_STATUS_SPEED_SHIFT)
#define NETC_PHY_STATUS_SPEED_1000      (2u << NETC_PHY_STATUS_SPEED_SHIFT)

#define NETC_RING_COUNT                 8u
/* Port-masquerade TX uses SI management+1 ring per MCUX SWT_SendFrame. */
#define NETC_TX_BDR                     1u
#define NETC_RX_BDR                     0u
#define NETC_SI_BDR_COUNT               2u
#define NETC_DESCRIPTOR_ALIGNMENT       128u
#define NETC_DMA_ALIGNMENT              32u
#define NETC_DMA_BUFFER_SIZE            1536u
#define NETC_POLL_DELAY                 MSEC2TICK(10)
#define NETC_LINK_POLL_INTERVAL_MS      100u

#define NETC_RX_READY                   (1ull << 62)
#define NETC_RX_FINAL                   (1ull << 63)
#define NETC_RX_ERROR_SHIFT             48
#define NETC_TX_FINAL                   (1ull << 63)
/* MCUX port-masquerade TX: FLQ=2 + switch ingress port (no SMSO). */
#define NETC_TX_SWITCH_MASQUERADE(port) \
  ((uint64_t)(((2u << 24) | \
               (((uint32_t)(port) & 0x1fu) << 16))) << 32)
/* MCUX / Zephyr DSA no-tag: FLQ=2 + SMSO + egress port (bypass bridge). */
#define NETC_TX_SWITCH_DIRECT(port) \
  ((uint64_t)(((2u << 24) | (1u << 23) | \
               (((uint32_t)(port) & 0x1fu) << 16))) << 32)
#define NETC_ETH_MIN_FRAME              60u

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#else
#  define ETHWORK LPWORK
#endif

#define IOMUXC_MUX_SION                (1u << 4)
#define IOMUXC_PAD_ETHERNET             0x06u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct imxrt_netc_pin_s
{
  uintptr_t mux;
  uintptr_t input;
  uintptr_t pad;
  uint8_t mode;
  uint8_t daisy;
  bool input_enable;
};

struct imxrt_netc_desc_s
{
  uint64_t word0;
  uint64_t word1;
};

struct imxrt_netc_link_s
{
  bool up;
  bool full_duplex;
  uint16_t speed;
};

struct imxrt_netc_driver_s
{
  bool registered;
  bool ifup;
  uint8_t active_port;
  uint8_t active_phy;
  uint16_t txhead;
  uint16_t txclean;
  uint16_t rxtail;
  struct wdog_s polltimer;
  struct work_s pollwork;
  struct net_driver_s dev;
  uint8_t buffer[MAX_NETDEV_PKTSIZE + CONFIG_NET_GUARDSIZE]
    aligned_data(NETC_DMA_ALIGNMENT);
  struct imxrt_netc_desc_s txring[NETC_RING_COUNT]
    aligned_data(NETC_DESCRIPTOR_ALIGNMENT);
  struct imxrt_netc_desc_s rxring[NETC_RING_COUNT]
    aligned_data(NETC_DESCRIPTOR_ALIGNMENT);
  uint8_t txpool[NETC_RING_COUNT][NETC_DMA_BUFFER_SIZE]
    aligned_data(NETC_DMA_ALIGNMENT);
  uint8_t rxpool[NETC_RING_COUNT][NETC_DMA_BUFFER_SIZE]
    aligned_data(NETC_DMA_ALIGNMENT);
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct imxrt_netc_pin_s g_netc_pins[] =
{
  {0x42a10184u, 0,           0x42a103ccu, 7, 0, false},
  {0x42a10188u, 0x42a10798u, 0x42a103d0u, 7, 4, false},
  {0x42a100ccu, 0,           0x42a10314u, 3, 0, false},
  {0x42a100d0u, 0,           0x42a10318u, 3, 0, false},
  {0x42a100c4u, 0,           0x42a1030cu, 4, 0, false},
  {0x42a100c8u, 0,           0x42a10310u, 4, 0, false},
  {0x42a100d4u, 0,           0x42a1031cu, 3, 0, false},
  {0x42a100d8u, 0x42a107f4u, 0x42a10320u, 3, 1, true},
  {0x42a100b8u, 0x42a107d8u, 0x42a10300u, 4, 0, false},
  {0x42a100dcu, 0x42a107e4u, 0x42a10324u, 3, 1, false},
  {0x42a100e0u, 0x42a107e8u, 0x42a10328u, 3, 1, false},
  {0x42a100bcu, 0x42a107ecu, 0x42a10304u, 4, 0, false},
  {0x42a100c0u, 0x42a107f0u, 0x42a10308u, 4, 0, false},
  {0x42a100e4u, 0x42a107dcu, 0x42a1032cu, 3, 1, false},
  {0x42a1007cu, 0,           0x42a102c4u, 4, 0, false},
  {0x42a10078u, 0,           0x42a102c0u, 4, 0, false},
  {0x42a100a4u, 0,           0x42a102ecu, 4, 0, false},
  {0x42a100a0u, 0,           0x42a102e8u, 4, 0, false},
  {0x42a10080u, 0,           0x42a102c8u, 4, 0, false},
  {0x42a10084u, 0x42a10814u, 0x42a102ccu, 4, 1, true},
  {0x42a100a8u, 0x42a107f8u, 0x42a102f0u, 4, 2, false},
  {0x42a10088u, 0x42a10804u, 0x42a102d0u, 4, 1, false},
  {0x42a1008cu, 0x42a10808u, 0x42a102d4u, 4, 1, false},
  {0x42a10098u, 0x42a1080cu, 0x42a102e0u, 4, 1, false},
  {0x42a1009cu, 0x42a10810u, 0x42a102e4u, 4, 1, false},
  {0x42a10090u, 0x42a107fcu, 0x42a102d8u, 4, 1, false},
};

