apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
static struct imxrt_netc_driver_s g_netc;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void imxrt_netc_poll_expiry(wdparm_t arg);

static int imxrt_netc_wait_clear(uintptr_t address, uint32_t mask)
{
  unsigned int timeout;

  for (timeout = 0; timeout < CONFIG_IMXRT_NETC_MDIO_TIMEOUT_US; timeout++)
    {
      if ((getreg32(address) & mask) == 0)
        {
          return OK;
        }

      up_udelay(1);
    }

  return -ETIMEDOUT;
}

static void imxrt_netc_configure_pins(void)
{
  unsigned int i;

  for (i = 0; i < sizeof(g_netc_pins) / sizeof(g_netc_pins[0]); i++)
    {
      uint32_t mux = g_netc_pins[i].mode;

      if (g_netc_pins[i].input_enable)
        {
          mux |= IOMUXC_MUX_SION;
        }

      putreg32(mux, g_netc_pins[i].mux);
      if (g_netc_pins[i].input != 0)
        {
          putreg32(g_netc_pins[i].daisy, g_netc_pins[i].input);
        }

      putreg32(IOMUXC_PAD_ETHERNET, g_netc_pins[i].pad);
    }
}

static int imxrt_netc_board_initialize(void)
{
  uint32_t regval;
  int ret;

  modifyreg32(IMXRT_NETC_LINK0_CFG, NETC_LINK_CFG_MII_PROTOCOL_MASK,
              NETC_LINK_CFG_MII_PROTOCOL_RGMII);
  modifyreg32(IMXRT_NETC_LINK2_CFG, NETC_LINK_CFG_MII_PROTOCOL_MASK,
              NETC_LINK_CFG_MII_PROTOCOL_RGMII);

  modifyreg32(IMXRT_NETC_PRIV_NETCRR, NETC_PRIV_NETCRR_LOCK, 0);
  ret = imxrt_netc_wait_clear(IMXRT_NETC_PRIV_NETCRR,
                              NETC_PRIV_NETCRR_LOCK);
  if (ret < 0)
    {
      nerr("NETC: IERB unlock timed out\n");
      return ret;
    }

  regval = getreg32(IMXRT_NETC_IERB_RCMSIAMQR);
  regval &= ~NETC_IERB_RCMSIAMQR_MSI_MASK;
  regval |= NETC_IERB_RCMSIAMQR_MSI_CM33;
  putreg32(regval, IMXRT_NETC_IERB_RCMSIAMQR);
  putreg32(NETC_IERB_LINK_PHY_ADDRESS(
             CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS),
           IMXRT_NETC_IERB_L0BCR);
  putreg32(NETC_IERB_LINK_PHY_ADDRESS(
             CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS),
           IMXRT_NETC_IERB_L2BCR);

  modifyreg32(IMXRT_NETC_PRIV_NETCRR, 0, NETC_PRIV_NETCRR_LOCK);
  ret = imxrt_netc_wait_clear(IMXRT_NETC_PRIV_NETCSR,
                              NETC_PRIV_NETCSR_STATE);
  if (ret < 0)
    {
      nerr("NETC: IERB relock timed out\n");
    }

  return ret;
}

static int imxrt_netc_emdio_initialize(void)
{
  uint32_t divisor;
  uint16_t regval;
  int ret;

  ret = imxrt_netc_clocks_configure();
  if (ret < 0)
    {
      nerr("NETC: clock configuration failed: %d\n", ret);
      return ret;
    }

  imxrt_netc_configure_pins();

  ret = imxrt_netc_board_initialize();
  if (ret < 0)
    {
      return ret;
    }

  /* Reset the independent EMDIO PCI function, then permit its register
   * accesses.  MSI-X is deliberately not configured in this MDIO-only slice.
   */

  regval = getreg16(IMXRT_NETC_F1_DEVICE_CONTROL);
  putreg16(regval | NETC_PCI_DEVICE_CONTROL_FLR,
           IMXRT_NETC_F1_DEVICE_CONTROL);

  ret = imxrt_netc_wait_clear(IMXRT_NETC_F1_DEVICE_CONTROL,
                              NETC_PCI_DEVICE_CONTROL_FLR);
  if (ret < 0)
    {
      nerr("NETC: EMDIO function reset timed out\n");
      return ret;
    }

  regval = getreg16(IMXRT_NETC_F1_COMMAND);
  regval |= NETC_PCI_COMMAND_MEMORY | NETC_PCI_COMMAND_MASTER;
  putreg16(regval, IMXRT_NETC_F1_COMMAND);

  divisor = (CONFIG_IMXRT_NETC_CLOCK_FREQUENCY +
             NETC_MDC_DIVISOR - 1) / NETC_MDC_DIVISOR;
  if (divisor == 0 || divisor > 0x1ffu)
    {
      return -ERANGE;
    }

  putreg32((divisor << NETC_EMDIO_CFG_DIV_SHIFT) |
           (NETC_MDIO_HOLD_RECOMMENDED << NETC_EMDIO_CFG_HOLD_SHIFT),
           IMXRT_NETC_EMDIO_CFG);
  return OK;
}

static int imxrt_netc_probe_phy(uint8_t phyaddr, const char *port)
{
  uint16_t phyid1;
  uint16_t phyid2;
  int ret;

  ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_ID1, &phyid1);
  if (ret == OK)
    {
      ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_ID2, &phyid2);
    }

  if (ret < 0)
    {
      nerr("NETC: FRDM switch %s PHY address %u probe failed: %d\n",
           port, phyaddr, ret);
      return ret;
    }

  if ((phyid1 == 0 && phyid2 == 0) ||
      (phyid1 == 0xffff && phyid2 == 0xffff))
    {
      nerr("NETC: invalid %s PHY ID %04x:%04x at address %u\n",
           port, phyid1, phyid2, phyaddr);
      return -ENODEV;
    }

  ninfo("NETC: FRDM switch %s PHY ID %04x:%04x at address %u\n",
        port, phyid1, phyid2, phyaddr);
  return OK;
}

static int imxrt_netc_mdio_write(uint8_t phyaddr, uint8_t regaddr,
                                 uint16_t value)
{
  uint32_t config;
  int ret;

  if (phyaddr > 31 || regaddr > 31)
    {
      return -EINVAL;
    }

  config = getreg32(IMXRT_NETC_EMDIO_CFG);
  config &= ~NETC_EMDIO_CFG_CLAUSE45;
  putreg32(config, IMXRT_NETC_EMDIO_CFG);
  putreg32(((uint32_t)phyaddr << NETC_EMDIO_CONTROL_PHY_SHIFT) |
           ((uint32_t)regaddr << NETC_EMDIO_CONTROL_REG_SHIFT),
           IMXRT_NETC_EMDIO_CONTROL);
  putreg32(value, IMXRT_NETC_EMDIO_DATA);

  ret = imxrt_netc_wait_clear(IMXRT_NETC_EMDIO_CFG,
                              NETC_EMDIO_CFG_BUSY);
  if (ret < 0)
    {
      return ret;
    }

  config = getreg32(IMXRT_NETC_EMDIO_CFG);
  if ((config & NETC_EMDIO_CFG_ADDRESS_ERROR) != 0)
    {
      return -EIO;
    }

  return OK;
}

static int imxrt_netc_phy_modify_ext(uint8_t phyaddr, uint16_t regaddr,
                                     uint16_t mask, uint16_t set)
{
  uint16_t value;
  int ret;

  ret = imxrt_netc_mdio_write(phyaddr, NETC_PHY_PAGE_SELECT, regaddr);
  if (ret < 0)
    {
      return ret;
    }

  ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_PAGE_DATA, &value);
  if (ret < 0)
    {
      return ret;
    }

  value = (value & ~mask) | set;
  return imxrt_netc_mdio_write(phyaddr, NETC_PHY_PAGE_DATA, value);
}

static int imxrt_netc_yt8531_configure_delay(uint8_t phyaddr)
{
  uint16_t delays;
  int ret;

  /* Zephyr FRDM: clear RXC_DLY_EN, then program RGMII delay selects. */

  ret = imxrt_netc_phy_modify_ext(phyaddr, NETC_YT8531_CHIP_CONFIG,
                                  NETC_YT8531_CCR_RXC_DLY_EN, 0);
  if (ret < 0)
    {
      return ret;
    }

