apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
  delays = ((CONFIG_IMXRT_NETC_YT8531_RX_DELAY &
             NETC_YT8531_DELAY_MASK) << NETC_YT8531_RX_DELAY_SHIFT) |
           ((CONFIG_IMXRT_NETC_YT8531_TX_DELAY &
             NETC_YT8531_DELAY_MASK) << NETC_YT8531_TX_DELAY_SHIFT);

  ret = imxrt_netc_phy_modify_ext(phyaddr, NETC_YT8531_RGMII_CONFIG1,
                                  (NETC_YT8531_DELAY_MASK <<
                                   NETC_YT8531_RX_DELAY_SHIFT) |
                                  (NETC_YT8531_DELAY_MASK <<
                                   NETC_YT8531_TX_DELAY_SHIFT),
                                  delays);
  if (ret < 0)
    {
      nerr("NETC: YT8531 delay config failed at PHY %u: %d\n",
           phyaddr, ret);
      return ret;
    }

  ninfo("NETC: YT8531 PHY %u RGMII delay rx=%u tx=%u\n",
        phyaddr, CONFIG_IMXRT_NETC_YT8531_RX_DELAY,
        CONFIG_IMXRT_NETC_YT8531_TX_DELAY);
  return OK;
}

static int imxrt_netc_phy_link(uint8_t phyaddr,
                               struct imxrt_netc_link_s *link)
{
  uint16_t bmsr;
  uint16_t status;
  int ret;

  ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_BMSR, &bmsr);
  if (ret == OK)
    {
      ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_BMSR, &bmsr);
    }

  if (ret < 0)
    {
      return ret;
    }

  memset(link, 0, sizeof(*link));
  if ((bmsr & NETC_PHY_BMSR_LINK) == 0)
    {
      return OK;
    }

  if ((bmsr & NETC_PHY_BMSR_AN_COMPLETE) == 0)
    {
      return -EAGAIN;
    }

  ret = imxrt_netc_mdio_read(phyaddr, NETC_PHY_SPECIFIC_STATUS, &status);
  if (ret < 0)
    {
      return ret;
    }

  link->up = (status & NETC_PHY_STATUS_LINK) != 0;
  link->full_duplex = (status & NETC_PHY_STATUS_DUPLEX) != 0;

  switch (status & NETC_PHY_STATUS_SPEED_MASK)
    {
      case NETC_PHY_STATUS_SPEED_10:
        link->speed = 10;
        break;

      case NETC_PHY_STATUS_SPEED_100:
        link->speed = 100;
        break;

      case NETC_PHY_STATUS_SPEED_1000:
        link->speed = 1000;
        break;

      default:
        return -EPROTO;
    }

  return OK;
}

static void imxrt_netc_clean(void *address, size_t size)
{
  up_clean_dcache((uintptr_t)address, (uintptr_t)address + size);
}

static void imxrt_netc_invalidate(void *address, size_t size)
{
  up_invalidate_dcache((uintptr_t)address, (uintptr_t)address + size);
}

static void imxrt_netc_set_mac(struct imxrt_netc_driver_s *priv)
{
  const uint8_t *mac = priv->dev.d_mac.ether.ether_addr_octet;
  uint32_t low;
  uint32_t high;

  low = (uint32_t)mac[0] | ((uint32_t)mac[1] << 8) |
        ((uint32_t)mac[2] << 16) | ((uint32_t)mac[3] << 24);
  high = (uint32_t)mac[4] | ((uint32_t)mac[5] << 8);

  putreg32(low, IMXRT_NETC_ENETC1_PSIPMAR0);
  putreg32(high, IMXRT_NETC_ENETC1_PSIPMAR1);

  /* Bring-up: accept untagged + UC/MC promiscuous so ARP/DHCP replies are
   * not dropped by default L2/VLAN filters while the data path is proven.
   */

  putreg32(NETC_ENETC_PSIPMMR_SI0_MAC_UP | NETC_ENETC_PSIPMMR_SI0_MAC_MP,
           IMXRT_NETC_ENETC1_PSIPMMR);
  putreg32(NETC_ENETC_PSIPVMR_SI0_VLAN_P | NETC_ENETC_PSIPVMR_SI0_VLAN_UTA,
           IMXRT_NETC_ENETC1_PSIPVMR);
}

static int imxrt_netc_reset_function(uintptr_t control,
                                     uintptr_t command,
                                     const char *name)
{
  uint16_t regval;
  int ret;

  /* NETC requires PCI memory and bus-master access before the function
   * reset so that the Ethernet MAC reset path can complete.
   */

  regval = getreg16(command);
  regval |= NETC_PCI_COMMAND_MEMORY | NETC_PCI_COMMAND_MASTER;
  putreg16(regval, command);

  regval = getreg16(control);
  putreg16(regval | NETC_PCI_DEVICE_CONTROL_FLR, control);
  ret = imxrt_netc_wait_clear(control, NETC_PCI_DEVICE_CONTROL_FLR);
  if (ret < 0)
    {
      nerr("NETC: %s function reset timed out\n", name);
      return ret;
    }

  /* FLR clears the command register. */

  regval = getreg16(command);
  regval |= NETC_PCI_COMMAND_MEMORY | NETC_PCI_COMMAND_MASTER;
  putreg16(regval, command);
  return OK;
}

static void
imxrt_netc_switch_port_set_mac(uint8_t port, const uint8_t *mac)
{
  uint32_t low;
  uint32_t high;

  low = (uint32_t)mac[0] | ((uint32_t)mac[1] << 8) |
        ((uint32_t)mac[2] << 16) | ((uint32_t)mac[3] << 24);
  high = (uint32_t)mac[4] | ((uint32_t)mac[5] << 8);
  putreg32(low, NETC_SWITCH_PORT_PMAR0(port));
  putreg32(high, NETC_SWITCH_PORT_PMAR1(port));
}

static int imxrt_netc_eth_mac_software_reset(uint8_t port)
{
  int ret;

  /* Match SWT_Init: hold Tx/Rx disabled while clearing MAC FIFOs. */

  modifyreg32(NETC_SWITCH_PORT_POR(port), 0,
              NETC_SWITCH_PORT_TXRX_DISABLE);
  putreg32(getreg32(NETC_SWITCH_PORT_COMMAND(port)) | NETC_SWITCH_MAC_SWR,
           NETC_SWITCH_PORT_COMMAND(port));
  ret = imxrt_netc_wait_clear(NETC_SWITCH_PORT_COMMAND(port),
                              NETC_SWITCH_MAC_SWR);
  if (ret < 0)
    {
      return ret;
    }

  putreg32(getreg32(NETC_SWITCH_PORT_COMMAND_PM1(port)) |
           NETC_SWITCH_MAC_SWR,
           NETC_SWITCH_PORT_COMMAND_PM1(port));
  return imxrt_netc_wait_clear(NETC_SWITCH_PORT_COMMAND_PM1(port),
                               NETC_SWITCH_MAC_SWR);
}

static void
imxrt_netc_switch_port_configure(uint8_t port,
                                 const struct imxrt_netc_link_s *link,
                                 const uint8_t *mac)
{
  uint32_t mode;
  uint32_t command;
  unsigned int tc;

  putreg32(NETC_SWITCH_PORT_SPEED_1G, NETC_SWITCH_PORT_PCR(port));
  putreg32(0, NETC_SWITCH_PORT_PSGCR(port));
  putreg32(NETC_SWITCH_PORT_PPDU_BCO, NETC_SWITCH_PORT_PRXSDUOR(port));
  putreg32(NETC_SWITCH_PORT_PPDU_BCO, NETC_SWITCH_PORT_PTXSDUOR(port));
  imxrt_netc_switch_port_set_mac(port, mac);
  modifyreg32(NETC_SWITCH_PORT_PTGSCR(port),
              NETC_SWITCH_PORT_TIME_GATE_ENABLE, 0);
  putreg32(NETC_SWITCH_PORT_TC_GATES_OPEN,
           NETC_SWITCH_PORT_PDGSR(port));
  for (tc = 0; tc < 8; tc++)
    {
      putreg32(NETC_SWITCH_PORT_TC_MPDU_MAX,
               NETC_SWITCH_PORT_PTCTMSDUR(port, tc));
    }

  putreg32(NETC_SWITCH_PORT_ACCEPT_ALL_TAGS |
           NETC_SWITCH_PORT_RXVAM,
           NETC_SWITCH_PORT_BPDVR(port));
  putreg32(NETC_SWITCH_STG0_FORWARD, NETC_SWITCH_PORT_BPSTGSR(port));
  putreg32(0, NETC_SWITCH_PORT_BPCR(port));
  putreg32(NETC_SWITCH_STORM_ENTRY_DISABLE,
           NETC_SWITCH_PORT_BPSCR0(port));
  putreg32(NETC_SWITCH_STORM_ENTRY_DISABLE,
           NETC_SWITCH_PORT_BPSCR1(port));

  if (port != 4)
    {
      mode = NETC_SWITCH_IFMODE_RGMII;
      if (link->speed == 1000)
        {
          mode |= NETC_SWITCH_IFMODE_SPEED_1000;
        }
      else if (link->speed == 100)
        {
          mode |= NETC_SWITCH_IFMODE_SPEED_100;
        }
      else
        {
          mode |= NETC_SWITCH_IFMODE_SPEED_10;
        }

      if (!link->full_duplex)
        {
          mode |= NETC_SWITCH_IFMODE_HALF_DUPLEX;
        }

      /* MCUX NETC_PortConfigEthMac programs express + preempt MACs. */

