apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
      putreg32(mode, NETC_SWITCH_PORT_IF_MODE(port));
      putreg32(mode, NETC_SWITCH_PORT_IF_MODE_PM1(port));
      putreg32(NETC_SWITCH_MAC_MAX_FRAME,
               NETC_SWITCH_PORT_MAXFRM(port));
      putreg32(NETC_SWITCH_MAC_MAX_FRAME,
               NETC_SWITCH_PORT_MAXFRM_PM1(port));
      putreg32(NETC_SWITCH_PORT_CUT_THROUGH_OFF,
               NETC_SWITCH_PORT_PCTFCR(port));
      command = NETC_SWITCH_MAC_TX_ENABLE |
                NETC_SWITCH_MAC_RX_ENABLE |
                NETC_SWITCH_MAC_CNT_FRM_EN |
                NETC_SWITCH_MAC_TX_PAD;
      putreg32(command, NETC_SWITCH_PORT_COMMAND(port));
      putreg32(command, NETC_SWITCH_PORT_COMMAND_PM1(port));
    }

  modifyreg32(NETC_SWITCH_PORT_POR(port),
              NETC_SWITCH_PORT_TXRX_DISABLE, 0);
}

static int imxrt_netc_switch_initialize(
  struct imxrt_netc_driver_s *priv,
  const struct imxrt_netc_link_s *port0,
  const struct imxrt_netc_link_s *port2)
{
  struct imxrt_netc_link_s internal =
  {
    .up = true,
    .full_duplex = true,
    .speed = 1000
  };

  const uint8_t *mac = priv->dev.d_mac.ether.ether_addr_octet;
  uint16_t cmd;
  int ret;

  ninfo("NETC: resetting switch eth MACs then function\n");

  /* SWT_Init enables PCI memory/master before eth MAC soft-reset. */

  cmd = getreg16(IMXRT_NETC_F2_COMMAND);
  cmd |= NETC_PCI_COMMAND_MEMORY | NETC_PCI_COMMAND_MASTER;
  putreg16(cmd, IMXRT_NETC_F2_COMMAND);

  ret = imxrt_netc_eth_mac_software_reset(0);
  if (ret < 0)
    {
      nerr("NETC: port 0 MAC soft-reset timed out\n");
      return ret;
    }

  ret = imxrt_netc_eth_mac_software_reset(2);
  if (ret < 0)
    {
      nerr("NETC: port 2 MAC soft-reset timed out\n");
      return ret;
    }

  ret = imxrt_netc_reset_function(IMXRT_NETC_F2_DEVICE_CONTROL,
                                  IMXRT_NETC_F2_COMMAND, "switch");
  if (ret < 0)
    {
      return ret;
    }

  ninfo("NETC: configuring switch core and ports\n");
  putreg32(NETC_SWITCH_VLAN_PORTS_MASK,
           IMXRT_NETC_SWITCH_VFHTDECR0);
  putreg32(0, IMXRT_NETC_SWITCH_VFHTDECR1);
  putreg32(NETC_SWITCH_FDB_LOOKUP_FLOOD |
           NETC_SWITCH_HW_MAC_LEARN,
           IMXRT_NETC_SWITCH_VFHTDECR2);

  imxrt_netc_switch_port_configure(0, port0, mac);
  imxrt_netc_switch_port_configure(2, port2, mac);
  imxrt_netc_switch_port_configure(4, &internal, mac);

  if (port0->up)
    {
      priv->active_port = 0;
      priv->active_phy = CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS;
    }
  else if (port2->up)
    {
      priv->active_port = 2;
      priv->active_phy = CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS;
    }
  else
    {
      return -ENETDOWN;
    }

  ninfo("NETC: switch selected external port %u\n", priv->active_port);
  return OK;
}

static int imxrt_netc_rings_initialize(struct imxrt_netc_driver_s *priv)
{
  uintptr_t address;
  uint32_t capability;
  unsigned int i;
  int ret;

  ninfo("NETC: enabling and resetting ENETC1 function\n");
  ret = imxrt_netc_reset_function(IMXRT_NETC_F4_DEVICE_CONTROL,
                                  IMXRT_NETC_F4_COMMAND, "ENETC1");
  if (ret < 0)
    {
      return ret;
    }

  capability = getreg32(IMXRT_NETC_ENETC1_ECAPR2);
  if (capability == 0 || capability == UINT32_MAX)
    {
      nerr("NETC: ENETC1 unavailable (clock or ELE/TRDC access)\n");
      return -EACCES;
    }

  ninfo("NETC: ENETC1 capability=%08" PRIx32 "\n", capability);
  memset(priv->txring, 0, sizeof(priv->txring));
  memset(priv->rxring, 0, sizeof(priv->rxring));
  priv->txhead = 0;
  priv->txclean = 0;
  priv->rxtail = 0;

  for (i = 0; i < NETC_RING_COUNT; i++)
    {
      priv->rxring[i].word0 = (uintptr_t)priv->rxpool[i];
    }

  imxrt_netc_clean(priv->txring, sizeof(priv->txring));
  imxrt_netc_clean(priv->rxring, sizeof(priv->rxring));
  imxrt_netc_invalidate(priv->rxpool, sizeof(priv->rxpool));

  /* Match the NXP management-ENETC setup: advertise one regular ring plus
   * one reserved management ring.  Regular Rx uses index 0; port-masquerade
   * Tx uses index 1 (MCUX cannot masquerade on SI0 hw ring 0).  Tx and Rx
   * register blocks are independent even when they share a BDR index.
   */

  putreg32(NETC_ENETC_PSICFGR0_TXRINGS(NETC_SI_BDR_COUNT) |
           NETC_ENETC_PSICFGR0_RXRINGS(NETC_SI_BDR_COUNT),
           IMXRT_NETC_ENETC1_PSICFGR0);
  imxrt_netc_set_mac(priv);

  /* RSS is disabled and RX uses a single ring, so one group of one ring. */

  putreg32(NETC_SI_SIRBGCR_NUM_GROUPS(0) |
           NETC_SI_SIRBGCR_RINGS_PER_GROUP(1),
           IMXRT_NETC_SI_SIRBGCR);

  address = (uintptr_t)priv->txring;
  putreg32((uint32_t)address, IMXRT_NETC_SI_TBBAR0(NETC_TX_BDR));
  putreg32(0, IMXRT_NETC_SI_TBBAR1(NETC_TX_BDR));
  putreg32(0, IMXRT_NETC_SI_TBPIR(NETC_TX_BDR));
  putreg32(0, IMXRT_NETC_SI_TBCIR(NETC_TX_BDR));
  putreg32(NETC_RING_COUNT, IMXRT_NETC_SI_TBLENR(NETC_TX_BDR));
  putreg32(0, IMXRT_NETC_SI_TBIER(NETC_TX_BDR));
  putreg32(NETC_SI_TBMR_ENABLE, IMXRT_NETC_SI_TBMR(NETC_TX_BDR));

  address = (uintptr_t)priv->rxring;
  putreg32((uint32_t)address, IMXRT_NETC_SI_RBBAR0(NETC_RX_BDR));
  putreg32(0, IMXRT_NETC_SI_RBBAR1(NETC_RX_BDR));
  putreg32(NETC_DMA_BUFFER_SIZE, IMXRT_NETC_SI_RBBSR(NETC_RX_BDR));
  putreg32(0, IMXRT_NETC_SI_RBCIR(NETC_RX_BDR));
  putreg32(NETC_RING_COUNT, IMXRT_NETC_SI_RBLENR(NETC_RX_BDR));
  putreg32(0, IMXRT_NETC_SI_RBIER(NETC_RX_BDR));
  putreg32(NETC_SI_RBMR_ENABLE, IMXRT_NETC_SI_RBMR(NETC_RX_BDR));

  modifyreg32(IMXRT_NETC_ENETC1_PMR, 0, NETC_ENETC_PMR_SI0EN);
  modifyreg32(IMXRT_NETC_SI_SIMR, 0, NETC_SI_SIMR_ENABLE);

  if ((getreg32(IMXRT_NETC_SI_SIMR) & NETC_SI_SIMR_ENABLE) == 0 ||
      (getreg32(IMXRT_NETC_SI_RBMR(NETC_RX_BDR)) &
       NETC_SI_RBMR_ENABLE) == 0)
    {
      nerr("NETC: ENETC1 descriptor enable rejected "
           "(BLK_CTRL/IERB/TRDC)\n");
      return -EACCES;
    }

  ninfo("NETC: ENETC1 polling descriptor rings enabled\n");
  return OK;
}

static void imxrt_netc_reclaim_tx(struct imxrt_netc_driver_s *priv)
{
  uint16_t consumer =
    getreg32(IMXRT_NETC_SI_TBCIR(NETC_TX_BDR)) % NETC_RING_COUNT;

  while (priv->txclean != consumer)
    {
      priv->txclean = (priv->txclean + 1) % NETC_RING_COUNT;
    }
}

static int imxrt_netc_transmit(struct imxrt_netc_driver_s *priv)
{
  struct imxrt_netc_desc_s *desc;
  uint16_t next;
  uint16_t framelen;
  uint16_t buflen;
  uint16_t consumer;

  imxrt_netc_reclaim_tx(priv);
  next = (priv->txhead + 1) % NETC_RING_COUNT;
  if (next == priv->txclean)
    {
      return -EBUSY;
    }

  if (priv->dev.d_len < 16 || priv->dev.d_len > NETC_DMA_BUFFER_SIZE)
    {
      NETDEV_TXERRORS(&priv->dev);
      return -EMSGSIZE;
    }

