apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
  framelen = priv->dev.d_len;
  buflen = framelen < NETC_ETH_MIN_FRAME ? NETC_ETH_MIN_FRAME : framelen;
  memset(priv->txpool[priv->txhead], 0, buflen);
  memcpy(priv->txpool[priv->txhead], priv->dev.d_buf, framelen);
  imxrt_netc_clean(priv->txpool[priv->txhead], buflen);

  desc = &priv->txring[priv->txhead];
  memset(desc, 0, sizeof(*desc));
  desc->word0 = (uintptr_t)priv->txpool[priv->txhead];
  desc->word1 = (uint64_t)buflen |
                ((uint64_t)buflen << 16) |
                NETC_TX_SWITCH_MASQUERADE(4) |
                NETC_TX_FINAL;
  imxrt_netc_clean(desc, sizeof(*desc));

  priv->txhead = next;
  putreg32(priv->txhead, IMXRT_NETC_SI_TBPIR(NETC_TX_BDR));
  consumer =
    getreg32(IMXRT_NETC_SI_TBCIR(NETC_TX_BDR)) % NETC_RING_COUNT;
  ninfo("NETC: TX queued len=%u ingress=4 egress=%u head=%u cir=%u\n",
        framelen, priv->active_port, priv->txhead, consumer);
  NETDEV_TXPACKETS(&priv->dev);
  NETDEV_TXDONE(&priv->dev);
  priv->dev.d_len = 0;
  return OK;
}

static int imxrt_netc_txpoll(struct net_driver_s *dev)
{
  return imxrt_netc_transmit(dev->d_private);
}

static void imxrt_netc_dispatch(struct imxrt_netc_driver_s *priv)
{
  struct eth_hdr_s *hdr = (struct eth_hdr_s *)priv->dev.d_buf;

  NETDEV_RXPACKETS(&priv->dev);

#ifdef CONFIG_NET_IPv4
  if (hdr->type == HTONS(ETHTYPE_IP))
    {
      NETDEV_RXIPV4(&priv->dev);
      ipv4_input(&priv->dev);
    }
  else
#endif
#ifdef CONFIG_NET_IPv6
  if (hdr->type == HTONS(ETHTYPE_IP6))
    {
      NETDEV_RXIPV6(&priv->dev);
      ipv6_input(&priv->dev);
    }
  else
#endif
#ifdef CONFIG_NET_ARP
  if (hdr->type == HTONS(ETHTYPE_ARP))
    {
      NETDEV_RXARP(&priv->dev);
      arp_input(&priv->dev);
    }
  else
#endif
    {
      NETDEV_RXDROPPED(&priv->dev);
      priv->dev.d_len = 0;
    }

  if (priv->dev.d_len > 0)
    {
      imxrt_netc_transmit(priv);
    }
}

static void imxrt_netc_receive(struct imxrt_netc_driver_s *priv)
{
  struct imxrt_netc_desc_s *desc;
  unsigned int budget = NETC_RING_COUNT;
  uint16_t length;

  while (budget-- > 0)
    {
      desc = &priv->rxring[priv->rxtail];
      imxrt_netc_invalidate(desc, sizeof(*desc));
      if ((desc->word1 & NETC_RX_READY) == 0)
        {
          break;
        }

      length = desc->word1 & 0xffffu;
      ninfo("NETC: RX ready len=%u word1=%016" PRIx64 "\n",
            length, desc->word1);
      if ((desc->word1 & NETC_RX_FINAL) == 0 ||
          ((desc->word1 >> NETC_RX_ERROR_SHIFT) & 0xffu) != 0 ||
          length == 0 || length > NETC_DMA_BUFFER_SIZE ||
          length > sizeof(priv->buffer))
        {
          NETDEV_RXERRORS(&priv->dev);
        }
      else
        {
          imxrt_netc_invalidate(priv->rxpool[priv->rxtail], length);
          memcpy(priv->buffer, priv->rxpool[priv->rxtail], length);
          priv->dev.d_buf = priv->buffer;
          priv->dev.d_len = length;
          imxrt_netc_dispatch(priv);
        }

      desc->word0 = (uintptr_t)priv->rxpool[priv->rxtail];
      desc->word1 = 0;
      imxrt_netc_clean(desc, sizeof(*desc));
      priv->rxtail = (priv->rxtail + 1) % NETC_RING_COUNT;
      putreg32(priv->rxtail, IMXRT_NETC_SI_RBCIR(NETC_RX_BDR));
    }

  priv->dev.d_buf = priv->buffer;
  priv->dev.d_len = 0;
}

static void imxrt_netc_poll_work(void *arg)
{
  struct imxrt_netc_driver_s *priv = arg;
  static unsigned int diagnostic_ticks;

  net_lock();
  if (priv->ifup)
    {
      imxrt_netc_receive(priv);
      imxrt_netc_reclaim_tx(priv);
      devif_poll(&priv->dev, imxrt_netc_txpoll);
      if (++diagnostic_ticks == 100)
        {
          /* Named counters only; never scan reserved gaps
           * (fault @ +0x1d0).
           */

          ninfo("NETC: path counters ext-rx=%" PRIu32
                " ext-tx=%" PRIu32
                " p0-rxd=%" PRIu32 "/%08" PRIx32
                " p0-txd=%" PRIu32 "/%08" PRIx32
                " p0-brd=%" PRIu32 "/%08" PRIx32
                " p4-brd=%" PRIu32 "/%08" PRIx32
                " conduit-bcast=%" PRIu32
                " si-frames=%" PRIu32 " rbpir=%" PRIu32 "\n",
                getreg32(NETC_SWITCH_PORT_RX_PACKETS(0)),
                getreg32(NETC_SWITCH_PORT_TX_PACKETS(0)),
                getreg32(NETC_SWITCH_PORT_RX_DISCARD(0)),
                getreg32(NETC_SWITCH_PORT_RX_DISCARD_R0(0)),
                getreg32(NETC_SWITCH_PORT_TX_DISCARD(0)),
                getreg32(NETC_SWITCH_PORT_TX_DISCARD_R0(0)),
                getreg32(NETC_SWITCH_PORT_BRIDGE_DISCARD(0)),
                getreg32(NETC_SWITCH_PORT_BRIDGE_DISCARD_R0(0)),
                getreg32(NETC_SWITCH_PORT_BRIDGE_DISCARD(4)),
                getreg32(NETC_SWITCH_PORT_BRIDGE_DISCARD_R0(4)),
                getreg32(NETC_SWITCH_PSEUDO_RX_BCAST(4)),
                getreg32(IMXRT_NETC_ENETC1_SI_BASE + 0x0308u),
                getreg32(IMXRT_NETC_SI_RBPIR(NETC_RX_BDR)));
          diagnostic_ticks = 0;
        }

      wd_start(&priv->polltimer, NETC_POLL_DELAY,
               imxrt_netc_poll_expiry, (wdparm_t)priv);
    }

  net_unlock();
}

static void imxrt_netc_poll_expiry(wdparm_t arg)
{
  struct imxrt_netc_driver_s *priv =
    (struct imxrt_netc_driver_s *)arg;

  work_queue(ETHWORK, &priv->pollwork, imxrt_netc_poll_work, priv, 0);
}

static int imxrt_netc_wait_link(struct imxrt_netc_link_s *port0,
                                struct imxrt_netc_link_s *port2,
                                int *port0_ret, int *port2_ret)
{
  unsigned int elapsed = 0;
  unsigned int delay;
  int ret;

  for (; ; )
    {
      *port0_ret =
        imxrt_netc_phy_link(CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS, port0);
      *port2_ret =
        imxrt_netc_phy_link(CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS, port2);

      if ((*port0_ret == OK && port0->up) ||
          (*port2_ret == OK && port2->up))
        {
          return OK;
        }

      if (elapsed >= CONFIG_IMXRT_NETC_LINK_TIMEOUT_MS)
        {
          return -ETIMEDOUT;
        }

      delay = CONFIG_IMXRT_NETC_LINK_TIMEOUT_MS - elapsed;
      if (delay > NETC_LINK_POLL_INTERVAL_MS)
        {
          delay = NETC_LINK_POLL_INTERVAL_MS;
        }

      ret = nxsig_usleep(delay * 1000u);
      if (ret < 0)
        {
          return ret;
        }

      elapsed += delay;
    }
}

static int imxrt_netc_ifup(struct net_driver_s *dev)
{
  struct imxrt_netc_driver_s *priv = dev->d_private;
  struct imxrt_netc_link_s port0;
  struct imxrt_netc_link_s port2;
  int port0_ret;
  int port2_ret;
  int ret;

  memset(&port0, 0, sizeof(port0));
  memset(&port2, 0, sizeof(port2));
  ret = imxrt_netc_wait_link(&port0, &port2, &port0_ret, &port2_ret);

  ninfo("NETC: switch port 0 PHY %u link=%s status=%d speed=%u "
        "duplex=%s\n", CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS,
        port0_ret == OK && port0.up ? "up" : "down", port0_ret,
        port0.speed, port0.full_duplex ? "full" : "half");
  ninfo("NETC: switch port 2 PHY %u link=%s status=%d speed=%u "
        "duplex=%s\n", CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS,
        port2_ret == OK && port2.up ? "up" : "down", port2_ret,
        port2.speed, port2.full_duplex ? "full" : "half");

