apache/nuttx/arch/arm/src/imxrt/imxrt_netc.c
  if (ret < 0)
    {
      nerr("NETC: no negotiated PHY link after %u ms: %d\n",
           CONFIG_IMXRT_NETC_LINK_TIMEOUT_MS, ret);
      return ret;
    }

  ret = imxrt_netc_switch_initialize(priv, &port0, &port2);
  if (ret < 0)
    {
      nerr("NETC: no usable FRDM switch link: %d\n", ret);
      return ret;
    }

  ret = imxrt_netc_rings_initialize(priv);
  if (ret < 0)
    {
      return ret;
    }

  priv->ifup = true;
  netdev_carrier_on(dev);
  wd_start(&priv->polltimer, NETC_POLL_DELAY,
           imxrt_netc_poll_expiry, (wdparm_t)priv);
  ninfo("NETC: eth0 up through switch port %u PHY %u "
        "(polling data path)\n", priv->active_port, priv->active_phy);
  return OK;
}

static int imxrt_netc_ifdown(struct net_driver_s *dev)
{
  struct imxrt_netc_driver_s *priv = dev->d_private;

  priv->ifup = false;
  wd_cancel(&priv->polltimer);
  work_cancel(ETHWORK, &priv->pollwork);
  modifyreg32(IMXRT_NETC_SI_SIMR, NETC_SI_SIMR_ENABLE, 0);
  modifyreg32(IMXRT_NETC_ENETC1_PMR, NETC_ENETC_PMR_SI0EN, 0);
  netdev_carrier_off(dev);
  return OK;
}

static int imxrt_netc_txavail(struct net_driver_s *dev)
{
  struct imxrt_netc_driver_s *priv = dev->d_private;

  if (priv->ifup && work_available(&priv->pollwork))
    {
      work_queue(ETHWORK, &priv->pollwork, imxrt_netc_poll_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int imxrt_netc_mdio_read(uint8_t phyaddr, uint8_t regaddr,
                         uint16_t *value)
{
  uint32_t config;
  int ret;

  if (value == NULL || phyaddr > 31 || regaddr > 31)
    {
      return -EINVAL;
    }

  config = getreg32(IMXRT_NETC_EMDIO_CFG);
  config &= ~NETC_EMDIO_CFG_CLAUSE45;
  putreg32(config, IMXRT_NETC_EMDIO_CFG);
  putreg32(NETC_EMDIO_CONTROL_READ |
           ((uint32_t)phyaddr << NETC_EMDIO_CONTROL_PHY_SHIFT) |
           ((uint32_t)regaddr << NETC_EMDIO_CONTROL_REG_SHIFT),
           IMXRT_NETC_EMDIO_CONTROL);

  ret = imxrt_netc_wait_clear(IMXRT_NETC_EMDIO_CFG,
                              NETC_EMDIO_CFG_BUSY);
  if (ret < 0)
    {
      return ret;
    }

  config = getreg32(IMXRT_NETC_EMDIO_CFG);
  if ((config & (NETC_EMDIO_CFG_READ_ERROR |
                 NETC_EMDIO_CFG_ADDRESS_ERROR)) != 0)
    {
      return -EIO;
    }

  *value = getreg32(IMXRT_NETC_EMDIO_DATA) & 0xffffu;
  return OK;
}

int imxrt_netc_initialize(void)
{
  struct imxrt_netc_driver_s *priv = &g_netc;
  uint8_t *mac;
  int port0;
  int port2;
  int ret;

  if (priv->registered)
    {
      return -EALREADY;
    }

  memset(priv, 0, sizeof(*priv));
  ret = imxrt_netc_emdio_initialize();
  if (ret < 0)
    {
      nerr("NETC: EMDIO initialization failed: %d\n", ret);
      return ret;
    }

  port0 = imxrt_netc_probe_phy(CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS,
                               "port 0");
  port2 = imxrt_netc_probe_phy(CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS,
                               "port 2");
  if (port0 < 0 && port2 < 0)
    {
      return -ENODEV;
    }

  if (port0 == OK)
    {
      ret = imxrt_netc_yt8531_configure_delay(
              CONFIG_IMXRT_NETC_PORT0_PHY_ADDRESS);
      if (ret < 0)
        {
          return ret;
        }
    }

  if (port2 == OK)
    {
      ret = imxrt_netc_yt8531_configure_delay(
              CONFIG_IMXRT_NETC_PORT2_PHY_ADDRESS);
      if (ret < 0)
        {
          return ret;
        }
    }

  priv->dev.d_buf       = priv->buffer;
  priv->dev.d_ifup      = imxrt_netc_ifup;
  priv->dev.d_ifdown    = imxrt_netc_ifdown;
  priv->dev.d_txavail   = imxrt_netc_txavail;
  priv->dev.d_private   = priv;

  /* Fork-local bench MAC until a board-unique source is wired. */

  mac = priv->dev.d_mac.ether.ether_addr_octet;
  mac[0] = 0x02;
  mac[1] = 0x00;
  mac[2] = 0x00;
  mac[3] = 0x01;
  mac[4] = 0x03;
  mac[5] = 0x00;

  ret = netdev_register(&priv->dev, NET_LL_ETHERNET);
  if (ret == OK)
    {
      priv->registered = true;
      ninfo("NETC: registered ENETC1/switch interface eth0; "
            "data path uses honest 10 ms polling\n");
    }

  return ret;
}
